'''
Ваш домашня робота зараз працює в консольному режимі та взаємодіє з користувачем у вигляді команд 
в консолі. 
Модифікуйте код вашого застосунку, щоб подання інформації користувачу 
(виведення карток з контактами користувача, сторінка з інформацією про доступні команди) 
було легко змінити. Для цього треба описати абстрактний базовий клас для 
користувальницьких уявлень та конкретні реалізації, які успадковують базовий клас та
 реалізують консольний інтерфейс.

'''

from abc import ABC, abstractmethod

class BotInterface(ABC):
    @abstractmethod
    def say_hello(self):
        pass
    def display_all(self):
        pass